YuZane/ExpressTrain/Device/MM32F5330/Include/reg_adc.h
#define ADC_ADDATA_CHANNELSELL_Pos       (16)
#define ADC_ADDATA_CHANNELSELL_Msk       (0x0FU << ADC_ADDATA_CHANNELSELL_Pos) /*!< CHANNELSEL[19:16] (ADC current channel convert data) */

#define ADC_ADDATA_OVERRUN_Pos           (20)
#define ADC_ADDATA_OVERRUN_Msk           (0x01U << ADC_ADDATA_OVERRUN_Pos)     /*!< ADC data will be cover */
#define ADC_ADDATA_VALID_Pos             (21)
#define ADC_ADDATA_VALID_Msk             (0x01U << ADC_ADDATA_VALID_Pos)       /*!< ADC data[11:0] is valid */
#define ADC_ADDATA_CHANNELSELH_Pos       (22)
#define ADC_ADDATA_CHANNELSELH_Msk       (0x01U << ADC_ADDATA_CHANNELSELH_Pos) /*!< Channel selection  For High Bits */

/**
  * @brief ADC_ADCFG Register Bit Definition
  */
#define ADC_ADCFG_ADEN_Pos               (0)
#define ADC_ADCFG_ADEN_Msk               (0x01U << ADC_ADCFG_ADEN_Pos)    /*!< Enable ADC convert */
#define ADC_ADCFG_AWDEN_Pos              (1)
#define ADC_ADCFG_AWDEN_Msk              (0x01U << ADC_ADCFG_AWDEN_Pos)   /*!< Enable ADC window compare */

#define ADC_ADCFG_TSEN_Pos               (2)
#define ADC_ADCFG_TSEN_Msk               (0x01U << ADC_ADCFG_TSEN_Pos)    /*!< Enable ADC temperature sensor */
#define ADC_ADCFG_VSEN_Pos               (3)
#define ADC_ADCFG_VSEN_Msk               (0x01U << ADC_ADCFG_VSEN_Pos)    /*!< Enable ADC voltage reference */

#define ADC_ADCFG_RSLTCTL_Pos            (7)
#define ADC_ADCFG_RSLTCTL_Msk            (0x07U << ADC_ADCFG_RSLTCTL_Pos) /*!< ADC resolution select */

#define ADC_ADCFG_JAWDEN_Pos             (16)
#define ADC_ADCFG_JAWDEN_Msk             (0x01U << ADC_ADCFG_JAWDEN_Pos)  /*!< Inject ADC conversion window comparison enable */

/**
  * @brief ADC_ADCR Register Bit Definition
  */
#define ADC_ADCR_EOSIE_Pos               (0)
#define ADC_ADCR_EOSIE_Msk               (0x01U << ADC_ADCR_EOSIE_Pos)    /*!< ADC interrupt enable */
#define ADC_ADCR_AWDIE_Pos               (1)
#define ADC_ADCR_AWDIE_Msk               (0x01U << ADC_ADCR_AWDIE_Pos)    /*!< ADC window compare interrupt enable */
#define ADC_ADCR_TRGEN_Pos               (2)
#define ADC_ADCR_TRGEN_Msk               (0x01U << ADC_ADCR_TRGEN_Pos)    /*!< extranal trigger single start AD convert */
#define ADC_ADCR_DMAEN_Pos               (3)
#define ADC_ADCR_DMAEN_Msk               (0x01U << ADC_ADCR_DMAEN_Pos)    /*!< ADC DMA enable */

#define ADC_ADCR_ADST_Pos                (8)
#define ADC_ADCR_ADST_Msk                (0x01U << ADC_ADCR_ADST_Pos)     /*!< ADC start convert data */
#define ADC_ADCR_ADMD_Pos                (9)
#define ADC_ADCR_ADMD_Msk                (0x03U << ADC_ADCR_ADMD_Pos)     /*!< ADC convert mode */
#define ADC_ADCR_IMM                     (0x00U << ADC_ADCR_ADMD_Pos)     /*!< ADC imm convert mode */
#define ADC_ADCR_SCAN                    (0x01U << ADC_ADCR_ADMD_Pos)     /*!< ADC scan convert mode */
#define ADC_ADCR_CONTINUE                (0x02U << ADC_ADCR_ADMD_Pos)     /*!< ADC continue scan convert mode */
#define ADC_ADCR_ALIGN_Pos               (11)
#define ADC_ADCR_ALIGN_Msk               (0x01U << ADC_ADCR_ALIGN_Pos)    /*!< ADC data align */
#define ADC_ADCR_LEFT                    (0x01U << ADC_ADCR_ALIGN_Pos)    /*!< ADC data left align */
#define ADC_ADCR_RIGHT                   (0x00U << ADC_ADCR_ALIGN_Pos)    /*!< ADC data right align */
#define ADC_ADCR_CMPCHL_Pos              (12)
#define ADC_ADCR_CMPCHL_Msk              (0x0FU << ADC_ADCR_CMPCHL_Pos)   /*!< CMPCH[15:12] ADC window compare channel0 convert data */

#define ADC_ADCR_SCANDIR_Pos             (16)
#define ADC_ADCR_SCANDIR_Msk             (0x01U << ADC_ADCR_SCANDIR_Pos)  /*!< ADC scan direction */

#define ADC_ADCR_TRGSHIFT_Pos            (19)
#define ADC_ADCR_TRGSHIFT_Msk            (0x07U << ADC_ADCR_TRGSHIFT_Pos) /*!< External trigger shift sample */

#define ADC_ADCR_TRG_EDGE_Pos            (24)
#define ADC_ADCR_TRG_EDGE_Msk            (0x03U << ADC_ADCR_TRG_EDGE_Pos) /*!< ADC trig edge config */
#define ADC_ADCR_TRG_EDGE_UP             (0x02U << ADC_ADCR_TRG_EDGE_Pos) /*!< ADC up   edge trig mode */

#define ADC_ADCR_EOSMPIE_Pos             (26)
#define ADC_ADCR_EOSMPIE_Msk             (0X01U << ADC_ADCR_EOSMPIE_Pos)  /*!< ADC end sampling flag interrupt enable */
#define ADC_ADCR_EOCIE_Pos               (27)
#define ADC_ADCR_EOCIE_Msk               (0X01U << ADC_ADCR_EOCIE_Pos)    /*!< ADC end of conversion interrupt enable */

#define ADC_ADCR_CMPCHH_Pos              (28)
#define ADC_ADCR_CMPCHH_Msk              (0X01U << ADC_ADCR_CMPCHH_Pos)   /*!< Compare Channel Selection For Analog Watchdog For High Bits */

/**
  * @brief ADC_ADCHS Register Bit Definition
  */
#define ADC_ADCHS_CHEN0_Pos              (0)
#define ADC_ADCHS_CHEN0_Msk              (0x01U << ADC_ADCHS_CHEN0_Pos)  /*!< Enable ADC channel 0 */
#define ADC_ADCHS_CHEN1_Pos              (1)
#define ADC_ADCHS_CHEN1_Msk              (0x01U << ADC_ADCHS_CHEN1_Pos)  /*!< Enable ADC channel 1 */
#define ADC_ADCHS_CHEN2_Pos              (2)
#define ADC_ADCHS_CHEN2_Msk              (0x01U << ADC_ADCHS_CHEN2_Pos)  /*!< Enable ADC channel 2 */
#define ADC_ADCHS_CHEN3_Pos              (3)
#define ADC_ADCHS_CHEN3_Msk              (0x01U << ADC_ADCHS_CHEN3_Pos)  /*!< Enable ADC channel 3 */
#define ADC_ADCHS_CHEN4_Pos              (4)
#define ADC_ADCHS_CHEN4_Msk              (0x01U << ADC_ADCHS_CHEN4_Pos)  /*!< Enable ADC channel 4 */
#define ADC_ADCHS_CHEN5_Pos              (5)
#define ADC_ADCHS_CHEN5_Msk              (0x01U << ADC_ADCHS_CHEN5_Pos)  /*!< Enable ADC channel 5 */
#define ADC_ADCHS_CHEN6_Pos              (6)
#define ADC_ADCHS_CHEN6_Msk              (0x01U << ADC_ADCHS_CHEN6_Pos)  /*!< Enable ADC channel 6 */
#define ADC_ADCHS_CHEN7_Pos              (7)
#define ADC_ADCHS_CHEN7_Msk              (0x01U << ADC_ADCHS_CHEN7_Pos)  /*!< Enable ADC channel 7 */
#define ADC_ADCHS_CHEN8_Pos              (8)
#define ADC_ADCHS_CHEN8_Msk              (0x01U << ADC_ADCHS_CHEN8_Pos)  /*!< Enable ADC channel 8 */
#define ADC_ADCHS_CHEN9_Pos              (9)
#define ADC_ADCHS_CHEN9_Msk              (0x01U << ADC_ADCHS_CHEN9_Pos)  /*!< Enable ADC channel 9 */
#define ADC_ADCHS_CHEN10_Pos             (10)
#define ADC_ADCHS_CHEN10_Msk             (0x01U << ADC_ADCHS_CHEN10_Pos) /*!< Enable ADC channel 10 */
#define ADC_ADCHS_CHEN11_Pos             (11)
#define ADC_ADCHS_CHEN11_Msk             (0x01U << ADC_ADCHS_CHEN11_Pos) /*!< Enable ADC channel 11 */
#define ADC_ADCHS_CHEN12_Pos             (12)
#define ADC_ADCHS_CHEN12_Msk             (0x01U << ADC_ADCHS_CHEN12_Pos) /*!< Enable ADC channel 12 */
#define ADC_ADCHS_CHEN13_Pos             (13)
#define ADC_ADCHS_CHEN13_Msk             (0x01U << ADC_ADCHS_CHEN13_Pos) /*!< Enable ADC channel 13 */
#define ADC_ADCHS_CHEN14_Pos             (14)
#define ADC_ADCHS_CHEN14_Msk             (0x01U << ADC_ADCHS_CHEN14_Pos) /*!< Enable ADC channel 14 */
#define ADC_ADCHS_CHEN15_Pos             (15)
#define ADC_ADCHS_CHEN15_Msk             (0x01U << ADC_ADCHS_CHEN15_Pos) /*!< Enable ADC channel 15 */

/**
  * @brief ADC_ADCMPR Register Bit Definition
  */
#define ADC_ADCMPR_CMPLDATA_Pos          (0)
#define ADC_ADCMPR_CMPLDATA_Msk          (0x0FFFU << ADC_ADCMPR_CMPLDATA_Pos) /*!< ADC 12bit window compare DOWN LEVEL DATA */
#define ADC_ADCMPR_CMPHDATA_Pos          (16)
#define ADC_ADCMPR_CMPHDATA_Msk          (0x0FFFU << ADC_ADCMPR_CMPHDATA_Pos) /*!< ADC 12bit window compare UP LEVEL DATA */

/**
  * @brief ADC_ADSTA Register Bit Definition
  */
#define ADC_ADSTA_EOSIF_Pos              (0)
#define ADC_ADSTA_EOSIF_Msk              (0x01U << ADC_ADSTA_EOSIF_Pos)     /*!< ADC convert complete flag */
#define ADC_ADSTA_AWDIF_Pos              (1)
#define ADC_ADSTA_AWDIF_Msk              (0x01U << ADC_ADSTA_AWDIF_Pos)     /*!< ADC compare flag */
#define ADC_ADSTA_BUSY_Pos               (2)
#define ADC_ADSTA_BUSY_Msk               (0x01U << ADC_ADSTA_BUSY_Pos)      /*!< ADC busy flag */
#define ADC_ADSTA_CHANNELH_Pos           (3)
#define ADC_ADSTA_CHANNELH_Msk           (0x01U << ADC_ADSTA_CHANNELH_Pos)  /*!< Current Convert Channel For High Bits */
#define ADC_ADSTA_CHANNELL_Pos           (4)
#define ADC_ADSTA_CHANNELL_Msk           (0x0FU << ADC_ADSTA_CHANNELL_Pos)  /*!< CHANNEL[7:4] ADC current channel */

#define ADC_ADSTA_VALID_Pos              (8)
#define ADC_ADSTA_VALID_Msk              (0x0FFFU << ADC_ADSTA_VALID_Pos)   /*!< VALID[19:8] ADC channel 0..11 valid flag */
#define ADC_ADSTA_OVERRUN_Pos            (20)
#define ADC_ADSTA_OVERRUN_Msk            (0x0FFFU << ADC_ADSTA_OVERRUN_Pos) /*!< OVERRUN[31:20] ADC channel 0..11 data covered flag */

/**
  * @brief ADC_ADDRn Register Bit Definition
  */
#define ADC_ADDR_DATA_Pos                (0)
#define ADC_ADDR_DATA_Msk                (0xFFFFU << ADC_ADDR_DATA_Pos)  /*!< ADC channel convert data */
#define ADC_ADDR_OVERRUN_Pos             (20)
#define ADC_ADDR_OVERRUN_Msk             (0x01U << ADC_ADDR_OVERRUN_Pos) /*!< ADC data covered flag */
#define ADC_ADDR_VALID_Pos               (21)
#define ADC_ADDR_VALID_Msk               (0x01U << ADC_ADDR_VALID_Pos)   /*!< ADC data valid flag */

/**
  * @brief ADC_ADSTA_EXT Register Bit Definition
  */
#define ADC_ADSTA_EXT_VALID_Pos          (0)
#define ADC_ADSTA_EXT_VALID_Msk          (0x0FU << ADC_ADSTA_EXT_VALID_Pos)    /*!< VALID[3:0] ADC channel 12,14..15 valid flag */
#define ADC_ADSTA_EXT_OVERRUN_Pos        (4)
#define ADC_ADSTA_EXT_OVERRUN_Msk        (0x0FU << ADC_ADSTA_EXT_OVERRUN_Pos)  /*!< OVERRUN[7:4] ADC channel 12,14..15 data covered flag */

