YuZane/ExpressTrain/Device/MM32F5330/Include/reg_adc.h
#define ADC_ADSTA_EXT_EOSMPIF_Pos        (16)
#define ADC_ADSTA_EXT_EOSMPIF_Msk        (0x01U << ADC_ADSTA_EXT_EOSMPIF_Pos)  /*!< End of sampling interrupt flag */
#define ADC_ADSTA_EXT_EOCIF_Pos          (17)
#define ADC_ADSTA_EXT_EOCIF_Msk          (0x01U << ADC_ADSTA_EXT_EOCIF_Pos)    /*!< End of conversion interrupt flag */
#define ADC_ADSTA_EXT_JEOSMPIF_Pos       (18)
#define ADC_ADSTA_EXT_JEOSMPIF_Msk       (0x01U << ADC_ADSTA_EXT_JEOSMPIF_Pos) /*! Injected channel end of sampling interrupt flag */
#define ADC_ADSTA_EXT_JEOCIF_Pos         (19)
#define ADC_ADSTA_EXT_JEOCIF_Msk         (0x01U << ADC_ADSTA_EXT_JEOCIF_Pos)   /*!< Injected channel end of conversion interrupt flag */
#define ADC_ADSTA_EXT_JEOSIF_Pos         (20)
#define ADC_ADSTA_EXT_JEOSIF_Msk         (0x01U << ADC_ADSTA_EXT_JEOSIF_Pos)   /*!< Injected channel end of sequential conversion interrupt flag */
#define ADC_ADSTA_EXT_JBUSY_Pos          (21)
#define ADC_ADSTA_EXT_JBUSY_Msk          (0x01U << ADC_ADSTA_EXT_JBUSY_Pos)    /*!< Injection mode busy/idle */
#define ADC_ADSTA_EXT_EOCALIF_Pos        (24)
#define ADC_ADSTA_EXT_EOCALIF_Msk        (0x01U << ADC_ADSTA_EXT_EOCALIF_Pos)  /*!< End of calibration interrupt flag */
#define ADC_ADSTA_EXT_CALBUSY_Pos        (25)
#define ADC_ADSTA_EXT_CALBUSY_Msk        (0x01U << ADC_ADSTA_EXT_CALBUSY_Pos)  /*!< Busy */
#define ADC_ADSTA_EXT_FREOCIF_Pos        (26)
#define ADC_ADSTA_EXT_FREOCIF_Msk        (0x01U << ADC_ADSTA_EXT_FREOCIF_Pos)  /*!< Calibration factor reading and writing data register end flag */

/**
  * @brief ADC_CHANY0 select Register Bit Definition
  */
#define ADC_CHANY0_SELL0_Pos             (0)                                   /*!< CHANY_SEL0 (Bit 0) */
#define ADC_CHANY0_SELL0_Msk             (0x0FU << ADC_CHANY0_SELL0_Pos)       /*!< CHANY_SEL0 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SELL1_Pos             (4)                                   /*!< CHANY_SEL1 (Bit 4) */
#define ADC_CHANY0_SELL1_Msk             (0x0FU << ADC_CHANY0_SELL1_Pos)       /*!< CHANY_SEL1 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SELL2_Pos             (8)                                   /*!< CHANY_SEL2 (Bit 8) */
#define ADC_CHANY0_SELL2_Msk             (0x0FU << ADC_CHANY0_SELL2_Pos)       /*!< CHANY_SEL2 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SELL3_Pos             (12)                                  /*!< CHANY_SEL3 (Bit 12) */
#define ADC_CHANY0_SELL3_Msk             (0x0FU << ADC_CHANY0_SELL3_Pos)       /*!< CHANY_SEL3 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SELL4_Pos             (16)                                  /*!< CHANY_SEL4 (Bit 16) */
#define ADC_CHANY0_SELL4_Msk             (0x0FU << ADC_CHANY0_SELL4_Pos)       /*!< CHANY_SEL4 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SELL5_Pos             (20)                                  /*!< CHANY_SEL5 (Bit 20) */
#define ADC_CHANY0_SELL5_Msk             (0x0FU << ADC_CHANY0_SELL5_Pos)       /*!< CHANY_SEL5 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SELL6_Pos             (24)                                  /*!< CHANY_SEL6 (Bit 24) */
#define ADC_CHANY0_SELL6_Msk             (0x0FU << ADC_CHANY0_SELL6_Pos)       /*!< CHANY_SEL6 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY0_SELL7_Pos             (28)                                  /*!< CHANY_SEL7 (Bit 28) */
#define ADC_CHANY0_SELL7_Msk             (0x0FU << ADC_CHANY0_SELL7_Pos)       /*!< CHANY_SEL7 (Bitfield-Mask: 0x0f) */

/**
  * @brief ADC_CHANY1 select Register Bit Definition
  */
#define ADC_CHANY1_SELL8_Pos             (0)                                   /*!< CHANY_SEL8 (Bit 0) */
#define ADC_CHANY1_SELL8_Msk             (0x0FU << ADC_CHANY1_SELL8_Pos)       /*!< CHANY_SEL8 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SELL9_Pos             (4)                                   /*!< CHANY_SEL9 (Bit 4) */
#define ADC_CHANY1_SELL9_Msk             (0x0FU << ADC_CHANY1_SELL9_Pos)       /*!< CHANY_SEL9 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SELL10_Pos            (8)                                   /*!< CHANY_SEL10 (Bit 8) */
#define ADC_CHANY1_SELL10_Msk            (0x0FU << ADC_CHANY1_SELL10_Pos)      /*!< CHANY_SEL10 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SELL11_Pos            (12)                                  /*!< CHANY_SEL11 (Bit 12) */
#define ADC_CHANY1_SELL11_Msk            (0x0FU << ADC_CHANY1_SELL11_Pos)      /*!< CHANY_SEL11 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SELL12_Pos            (16)                                  /*!< CHANY_SEL12 (Bit 16) */
#define ADC_CHANY1_SELL12_Msk            (0x0FU << ADC_CHANY1_SELL12_Pos)      /*!< CHANY_SEL12 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SELL13_Pos            (20)                                  /*!< CHANY_SEL13 (Bit 20) */
#define ADC_CHANY1_SELL13_Msk            (0x0FU << ADC_CHANY1_SELL13_Pos)      /*!< CHANY_SEL13 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SELL14_Pos            (24)                                  /*!< CHANY_SEL14 (Bit 24) */
#define ADC_CHANY1_SELL14_Msk            (0x0FU << ADC_CHANY1_SELL14_Pos)      /*!< CHANY_SEL14 (Bitfield-Mask: 0x0f) */
#define ADC_CHANY1_SELL15_Pos            (28)                                  /*!< CHANY_SEL15 (Bit 28) */
#define ADC_CHANY1_SELL15_Msk            (0x0FU << ADC_CHANY1_SELL15_Pos)      /*!< CHANY_SEL15 (Bitfield-Mask: 0x0f) */

/**
  * @brief ADC_ANY_CFG config number Register Bit Definition
  */
#define ADC_ANY_CFG_CHANY_NUM_Pos        (0)
#define ADC_ANY_CFG_CHANY_NUM_Msk        (0x0FU << ADC_ANY_CFG_CHANY_NUM_Pos)    /*!< Number of Any Channel Mode */
#define ADC_ANY_CFG_CHANY_SELH0_Pos      (8)
#define ADC_ANY_CFG_CHANY_SELH0_Msk      (0x01U << ADC_ANY_CFG_CHANY_SELH0_Pos)  /*!< 0th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH1_Pos      (9)
#define ADC_ANY_CFG_CHANY_SELH1_Msk      (0x01U << ADC_ANY_CFG_CHANY_SELH1_Pos)  /*!< 1th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH2_Pos      (10)
#define ADC_ANY_CFG_CHANY_SELH2_Msk      (0x01U << ADC_ANY_CFG_CHANY_SELH2_Pos)  /*!< 2th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH3_Pos      (11)
#define ADC_ANY_CFG_CHANY_SELH3_Msk      (0x01U << ADC_ANY_CFG_CHANY_SELH3_Pos)  /*!< 3th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH4_Pos      (12)
#define ADC_ANY_CFG_CHANY_SELH4_Msk      (0x01U << ADC_ANY_CFG_CHANY_SELH4_Pos)  /*!< 4th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH5_Pos      (13)
#define ADC_ANY_CFG_CHANY_SELH5_Msk      (0x01U << ADC_ANY_CFG_CHANY_SELH5_Pos)  /*!< 5th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH6_Pos      (14)
#define ADC_ANY_CFG_CHANY_SELH6_Msk      (0x01U << ADC_ANY_CFG_CHANY_SELH6_Pos)  /*!< 6th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH7_Pos      (15)
#define ADC_ANY_CFG_CHANY_SELH7_Msk      (0x01U << ADC_ANY_CFG_CHANY_SELH7_Pos)  /*!< 7th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH8_Pos      (16)
#define ADC_ANY_CFG_CHANY_SELH8_Msk      (0x01U << ADC_ANY_CFG_CHANY_SELH8_Pos)  /*!< 8th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH9_Pos      (17)
#define ADC_ANY_CFG_CHANY_SELH9_Msk      (0x01U << ADC_ANY_CFG_CHANY_SELH9_Pos)  /*!< 9th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH10_Pos     (18)
#define ADC_ANY_CFG_CHANY_SELH10_Msk     (0x01U << ADC_ANY_CFG_CHANY_SELH10_Pos) /*!< 10th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH11_Pos     (19)
#define ADC_ANY_CFG_CHANY_SELH11_Msk     (0x01U << ADC_ANY_CFG_CHANY_SELH11_Pos) /*!< 11th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH12_Pos     (20)
#define ADC_ANY_CFG_CHANY_SELH12_Msk     (0x01U << ADC_ANY_CFG_CHANY_SELH12_Pos) /*!< 12th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH13_Pos     (21)
#define ADC_ANY_CFG_CHANY_SELH13_Msk     (0x01U << ADC_ANY_CFG_CHANY_SELH13_Pos) /*!< 13th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH14_Pos     (22)
#define ADC_ANY_CFG_CHANY_SELH14_Msk     (0x01U << ADC_ANY_CFG_CHANY_SELH14_Pos) /*!< 14th Conversion Select for Any Channel sequence For High Bits */
#define ADC_ANY_CFG_CHANY_SELH15_Pos     (23)
#define ADC_ANY_CFG_CHANY_SELH15_Msk     (0x01U << ADC_ANY_CFG_CHANY_SELH15_Pos) /*!< 15th Conversion Select for Any Channel sequence For High Bits */

/**
  * @brief ADC_ANY_CR mode enable Register Bit Definition
  */
#define ADC_ANY_CR_CHANY_MDEN_Pos        (0)                                     /*!< CHANY_MDEN (Bit 0) */
#define ADC_ANY_CR_CHANY_MDEN_Msk        (0x01U << ADC_ANY_CR_CHANY_MDEN_Pos)    /*!< CHANY_MDEN (Bitfield-Mask: 0x01) */
#define ADC_ANY_CR_JCEN_Pos              (1)
#define ADC_ANY_CR_JCEN_Msk              (0x01U << ADC_ANY_CR_JCEN_Pos)          /*!< Injected channel enable */
#define ADC_ANY_CR_JEOSMPIE_Pos          (2)
#define ADC_ANY_CR_JEOSMPIE_Msk          (0x01U << ADC_ANY_CR_JEOSMPIE_Pos)      /*!< Interrupt enable the end of sequence conversion for injected channel */
#define ADC_ANY_CR_JEOCIE_Pos            (3)
#define ADC_ANY_CR_JEOCIE_Msk            (0x01U << ADC_ANY_CR_JEOCIE_Pos)        /*!< Interrupt enable the end of conversion for injected channel */
#define ADC_ANY_CR_JEOSIE_Pos            (4)
#define ADC_ANY_CR_JEOSIE_Msk            (0x01U << ADC_ANY_CR_JEOSIE_Pos)        /*!< Interrupt enable the end of sequence conversion for injected channel */
#define ADC_ANY_CR_JAUTO_Pos             (5)
#define ADC_ANY_CR_JAUTO_Msk             (0x01U << ADC_ANY_CR_JAUTO_Pos)         /*!<Automatic Injected group conversion */
#define ADC_ANY_CR_JADST_Pos             (6)
#define ADC_ANY_CR_JADST_Msk             (0x01U << ADC_ANY_CR_JADST_Pos)         /*!< Start conversion of injected channels */
#define ADC_ANY_CR_JTRGEN_Pos            (7)
#define ADC_ANY_CR_JTRGEN_Msk            (0x01U << ADC_ANY_CR_JTRGEN_Pos)        /*!< External trigger conversion mode for injected channels */

#define ADC_ANY_CR_JTRGSHIFT_Pos         (13)                                    /*!< Injection mode external trigger delay sampling */
#define ADC_ANY_CR_JTRGSHIFT_Msk         (0x07U << ADC_ANY_CR_JTRGSHIFT_Pos)

#define ADC_ANY_CR_JTRGEDGE_Pos          (16)                                    /*!< Injection mode triggers edge selection */
#define ADC_ANY_CR_JTRGEDGE_Msk          (0x03U << ADC_ANY_CR_JTRGEDGE_Pos)
#define ADC_ANY_CR_JTRGEDGE_R            (0x02U << ADC_ANY_CR_JTRGEDGE_Pos)      /*!< Rising edge trigger */

