YuZane/ExpressTrain/Device/MM32F5330/Include/reg_adc.h
#define ADC_ANY_CR_ADCAL_Pos             (20)
#define ADC_ANY_CR_ADCAL_Msk             (0x01U << ADC_ANY_CR_ADCAL_Pos)         /*!< A/D Calibration */
#define ADC_ANY_CR_EOCALIE_Pos           (21)
#define ADC_ANY_CR_EOCALIE_Msk           (0x01U << ADC_ANY_CR_EOCALIE_Pos)       /*!< End of calibration interrupt enable */

/**
  * @brief ADC_ADCFG2 Register Bit Definition
  */
#define ADC_ADCFG2_CORREN_Pos            (0)
#define ADC_ADCFG2_CORREN_Msk            (0x01U << ADC_ADCFG2_CORREN_Pos)  /*!< Correct Enable */
#define ADC_ADCFG2_ADCCR_Pos             (1)
#define ADC_ADCFG2_ADCCR_Msk             (0x01U << ADC_ADCFG2_ADCCR_Pos)   /*!< ADC Control */

#define ADC_ADCFG2_ADCSREF_Pos           (2)
#define ADC_ADCFG2_ADCSREF_Msk           (0x01U << ADC_ADCFG2_ADCSREF_Pos) /*!< ADC Select Reference Voltage */

#define ADC_ADCFG2_DC_Pos                (4)
#define ADC_ADCFG2_DC_Msk                (0x1FU << ADC_ADCFG2_DC_Pos)      /*!< Differential Conversion */
#define ADC_ADCFG2_DC_0_1                (0x01U << ADC_ADCFG2_DC_Pos)      /*!< Channels 0 and 1 are a group of differential channels */
#define ADC_ADCFG2_DC_2_3                (0x02U << ADC_ADCFG2_DC_Pos)      /*!< Channels 2 and 3 are a group of differential channels */
#define ADC_ADCFG2_DC_4_5                (0x04U << ADC_ADCFG2_DC_Pos)      /*!< Channels 4 and 5 are a group of differential channels */
#define ADC_ADCFG2_DC_6_7                (0x08U << ADC_ADCFG2_DC_Pos)      /*!< Channels 6 and 7 are a group of differential channels */

#define ADC_ADCFG2_PSDC_Pos              (10)
#define ADC_ADCFG2_PSDC_Msk              (0x1FU << ADC_ADCFG2_PSDC_Pos)    /*!< Pseudo-differential Conversion */
#define ADC_ADCFG2_PSDC_0_1              (0x01U << ADC_ADCFG2_PSDC_Pos)    /*!< Channels 0 and 1 are a group of pseudo-differential channels */
#define ADC_ADCFG2_PSDC_2_3              (0x02U << ADC_ADCFG2_PSDC_Pos)    /*!< Channels 2 and 3 are a group of pseudo-differential channels */
#define ADC_ADCFG2_PSDC_4_5              (0x04U << ADC_ADCFG2_PSDC_Pos)    /*!< Channels 4 and 5 are a group of pseudo-differential channels */
#define ADC_ADCFG2_PSDC_6_7              (0x08U << ADC_ADCFG2_PSDC_Pos)    /*!< Channels 6 and 7 are a group of pseudo-differential channels */

#define ADC_ADCFG2_ROVSE_Pos             (16)
#define ADC_ADCFG2_ROVSE_Msk             (0x01U << ADC_ADCFG2_ROVSE_Pos)   /*!< Regular Oversampler Enable */

#define ADC_ADCFG2_JOVSE_Pos             (17)
#define ADC_ADCFG2_JOVSE_Msk             (0x01U << ADC_ADCFG2_JOVSE_Pos)   /*!< Injected Oversampler Enable */

#define ADC_ADCFG2_OVSR_Pos              (18)
#define ADC_ADCFG2_OVSR_Msk              (0x07U << ADC_ADCFG2_OVSR_Pos)    /*!< Oversampling Ratio */

#define ADC_ADCFG2_OVSS_Pos              (21)
#define ADC_ADCFG2_OVSS_Msk              (0x0FU << ADC_ADCFG2_OVSS_Pos)    /*!< Oversampling Shift Bits */

#define ADC_ADCFG2_TROVS_Pos             (25)
#define ADC_ADCFG2_TROVS_Msk             (0x01U << ADC_ADCFG2_TROVS_Pos)   /*!< Trigger Oversampling Select */

/**
  * @brief ADC_SMPR1 mode enable Register Bit Definition
  */
#define ADC_SMPR_SAMCTL_Pos              (0)                               /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR_SAMCTL_Msk              (0x0FU << ADC_SMPR_SAMCTL_Pos)    /*!< Injection mode external trigger delay sampling mask for Value */
#define ADC_SMPR_SAMCTL_3_5              (0x00U << ADC_SMPR_SAMCTL_Pos)    /*!< 3.5    cycle */
#define ADC_SMPR_SAMCTL_4_5              (0x01U << ADC_SMPR_SAMCTL_Pos)    /*!< 4.5    cycle */
#define ADC_SMPR_SAMCTL_5_5              (0x02U << ADC_SMPR_SAMCTL_Pos)    /*!< 5.5   cycle */
#define ADC_SMPR_SAMCTL_6_5              (0x03U << ADC_SMPR_SAMCTL_Pos)    /*!< 6.5   cycle */
#define ADC_SMPR_SAMCTL_7_5              (0x04U << ADC_SMPR_SAMCTL_Pos)    /*!< 7.5   cycle */
#define ADC_SMPR_SAMCTL_11_5             (0x05U << ADC_SMPR_SAMCTL_Pos)    /*!< 11.5   cycle */
#define ADC_SMPR_SAMCTL_13_5             (0x06U << ADC_SMPR_SAMCTL_Pos)    /*!< 13.5   cycle */
#define ADC_SMPR_SAMCTL_15_5             (0x07U << ADC_SMPR_SAMCTL_Pos)    /*!< 15.5   cycle */
#define ADC_SMPR_SAMCTL_19_5             (0x08U << ADC_SMPR_SAMCTL_Pos)    /*!< 19.5    cycle */
#define ADC_SMPR_SAMCTL_29_5             (0x09U << ADC_SMPR_SAMCTL_Pos)    /*!< 29.5    cycle */
#define ADC_SMPR_SAMCTL_39_5             (0x0AU << ADC_SMPR_SAMCTL_Pos)    /*!< 39.5    cycle */
#define ADC_SMPR_SAMCTL_59_5             (0x0BU << ADC_SMPR_SAMCTL_Pos)    /*!< 59.5    cycle */
#define ADC_SMPR_SAMCTL_79_5             (0x0CU << ADC_SMPR_SAMCTL_Pos)    /*!< 79.5    cycle */
#define ADC_SMPR_SAMCTL_119_5            (0x0DU << ADC_SMPR_SAMCTL_Pos)    /*!< 119.5    cycle */
#define ADC_SMPR_SAMCTL_159_5            (0x0EU << ADC_SMPR_SAMCTL_Pos)    /*!< 159.5    cycle */
#define ADC_SMPR_SAMCTL_240_5            (0x0FU << ADC_SMPR_SAMCTL_Pos)    /*!< 240.5    cycle */

#define ADC_SMPR1_SAMCTL7_Pos            (28)                              /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR1_SAMCTL7_Msk            (0x0FU << ADC_SMPR1_SAMCTL7_Pos)  /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR1_SAMCTL6_Pos            (24)                              /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR1_SAMCTL6_Msk            (0x0FU << ADC_SMPR1_SAMCTL6_Pos)  /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR1_SAMCTL5_Pos            (20)                              /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR1_SAMCTL5_Msk            (0x0FU << ADC_SMPR1_SAMCTL5_Pos)  /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR1_SAMCTL4_Pos            (16)                              /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR1_SAMCTL4_Msk            (0x0FU << ADC_SMPR1_SAMCTL4_Pos)  /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR1_SAMCTL3_Pos            (12)                              /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR1_SAMCTL3_Msk            (0x0FU << ADC_SMPR1_SAMCTL3_Pos)  /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR1_SAMCTL2_Pos            (8)                               /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR1_SAMCTL2_Msk            (0x0FU << ADC_SMPR1_SAMCTL2_Pos)  /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR1_SAMCTL1_Pos            (4)                               /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR1_SAMCTL1_Msk            (0x0FU << ADC_SMPR1_SAMCTL1_Pos)  /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR1_SAMCTL0_Pos            (0)                               /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR1_SAMCTL0_Msk            (0x0FU << ADC_SMPR1_SAMCTL0_Pos)  /*!< Injection mode external trigger delay sampling mask for Value */

/**
  * @brief ADC_SMPR2 mode enable Register Bit Definition
  */
#define ADC_SMPR2_SAMCTL15_Pos           (28)                              /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR2_SAMCTL15_Msk           (0x0FU << ADC_SMPR2_SAMCTL15_Pos) /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR2_SAMCTL15_240_5         (0x0FU << ADC_SMPR2_SAMCTL15_Pos) /*!< 240.5    cycle */
#define ADC_SMPR2_SAMCTL14_Pos           (24)                              /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR2_SAMCTL14_Msk           (0x0FU << ADC_SMPR2_SAMCTL14_Pos) /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR2_SAMCTL13_Pos           (20)                              /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR2_SAMCTL13_Msk           (0x0FU << ADC_SMPR2_SAMCTL13_Pos) /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR2_SAMCTL12_Pos           (16)                              /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR2_SAMCTL12_Msk           (0x0FU << ADC_SMPR2_SAMCTL12_Pos) /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR2_SAMCTL11_Pos           (12)                              /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR2_SAMCTL11_Msk           (0x0FU << ADC_SMPR2_SAMCTL11_Pos) /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR2_SAMCTL10_Pos           (8)                               /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR2_SAMCTL10_Msk           (0x0FU << ADC_SMPR2_SAMCTL10_Pos) /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR2_SAMCTL9_Pos            (4)                               /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR2_SAMCTL9_Msk            (0x0FU << ADC_SMPR2_SAMCTL9_Pos)  /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR2_SAMCTL8_Pos            (0)                               /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR2_SAMCTL8_Msk            (0x0FU << ADC_SMPR2_SAMCTL8_Pos)  /*!< Injection mode external trigger delay sampling mask for Value */

/**
  * @brief ADC_SMPR3 mode enable Register Bit Definition
  */
#define ADC_SMPR3_SAMCTL18_Pos           (8)                               /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR3_SAMCTL18_Msk           (0x0FU << ADC_SMPR3_SAMCTL18_Pos) /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR3_SAMCTL17_Pos           (4)                               /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR3_SAMCTL17_Msk           (0x0FU << ADC_SMPR3_SAMCTL17_Pos) /*!< Injection mode external trigger delay sampling mask for Value */

#define ADC_SMPR3_SAMCTL16_Pos           (0)                               /*!< Injection mode external trigger delay sampling off_set Position */
#define ADC_SMPR3_SAMCTL16_Msk           (0x0FU << ADC_SMPR3_SAMCTL16_Pos) /*!< Injection mode external trigger delay sampling mask for Value */

/**
  * @brief ADC_JOFR0 mode enable Register Bit Definition
  */
#define ADC_JOFR0_JOFFSET_Pos            (0)
#define ADC_JOFR0_JOFFSET_Msk            (0x0FFFU << ADC_JOFR0_JOFFSET_Pos) /*!< Compensates for the A/D conversion results of the injected channel 0 */

/**
  * @brief ADC_JOFR1 mode enable Register Bit Definition
  */
#define ADC_JOFR1_JOFFSET_Pos            (0)
#define ADC_JOFR1_JOFFSET_Msk            (0x0FFFU << ADC_JOFR1_JOFFSET_Pos) /*!< Compensates for the A/D conversion results of the injected channel 1 */
/**
  * @brief ADC_JOFR2 mode enable Register Bit Definition
  */
#define ADC_JOFR2_JOFFSET_Pos            (0)
#define ADC_JOFR2_JOFFSET_Msk            (0x0FFFU << ADC_JOFR2_JOFFSET_Pos) /*!< Compensates for the A/D conversion results of the injected channel 2 */

/**
  * @brief ADC_JOFR3 mode enable Register Bit Definition
  */
#define ADC_JOFR3_JOFFSET_Pos            (0)
#define ADC_JOFR3_JOFFSET_Msk            (0x0FFFU << ADC_JOFR3_JOFFSET_Pos) /*!< Compensates for the A/D conversion results of the injected channel 3 */

/**
  * @brief ADC_JSQR mode enable Register Bit Definition
  */
#define ADC_JSQR_JSQ0_Pos                (0)                                /*!< 1st conversion in injected sequence */
#define ADC_JSQR_JSQ0_Msk                (0x1FU << ADC_JSQR_JSQ0_Pos)

