YuZane/ExpressTrain/Device/MM32F5330/Include/reg_adc.h
#define ADC_JSQR_JSQ1_Pos                (5)                                /*!< 2st conversion in injected sequence */
#define ADC_JSQR_JSQ1_Msk                (0x1FU << ADC_JSQR_JSQ1_Pos)

#define ADC_JSQR_JSQ2_Pos                (10)                               /*!< 3st conversion in injected sequence */
#define ADC_JSQR_JSQ2_Msk                (0x1FU << ADC_JSQR_JSQ2_Pos)

#define ADC_JSQR_JSQ3_Pos                (15)                               /*!< 4st conversion in injected sequence */
#define ADC_JSQR_JSQ3_Msk                (0x1FU << ADC_JSQR_JSQ3_Pos)

#define ADC_JSQR_JNUM_Pos                (20)                               /*!< Injected Sequence length */
#define ADC_JSQR_JNUM_Msk                (0x03U << ADC_JSQR_JNUM_Pos)

/**
  * @brief ADC_JADDATA mode enable Register Bit Definition
  */
#define ADC_JADDATA_JDATA_Pos            (0)
#define ADC_JADDATA_JDATA_Msk            (0xFFFFU << ADC_JADDATA_JDATA_Pos)     /*!< Transfer data */
#define ADC_JADDATA_JCHANNELSEL_Pos      (16)
#define ADC_JADDATA_JCHANNELSEL_Msk      (0x1FU << ADC_JADDATA_JCHANNELSEL_Pos) /*!< Channel selection */
#define ADC_JADDATA_JOVERRUN_Pos         (21)
#define ADC_JADDATA_JOVERRUN_Msk         (0x01U << ADC_JADDATA_JOVERRUN_Pos)    /*!< Overrun flag */
#define ADC_JADDATA_JVALID_Pos           (22)
#define ADC_JADDATA_JVALID_Msk           (0x01U << ADC_JADDATA_JVALID_Pos)      /*!< Valid flag */

/**
  * @brief ADC_JDR0 mode enable Register Bit Definition
  */
#define ADC_JDR0_JVALID_Pos              (22)
#define ADC_JDR0_JVALID_Msk              (0x01U << ADC_JDR0_JVALID_Pos)   /*!< Valid flag */
#define ADC_JDR0_JOVERRUN_Pos            (21)
#define ADC_JDR0_JOVERRUN_Msk            (0x01U << ADC_JDR0_JOVERRUN_Pos) /*!< Overrun flag */
#define ADC_JDR0_JDATA_Pos               (0)
#define ADC_JDR0_JDATA_Msk               (0xFFFFU << ADC_JDR0_JDATA_Pos)  /*!< Transfer data */

/**
  * @brief ADC_JDR1 mode enable Register Bit Definition
  */
#define ADC_JDR1_JVALID_Pos              (22)
#define ADC_JDR1_JVALID_Msk              (0x01U << ADC_JDR1_JVALID_Pos)   /*!< Valid flag */
#define ADC_JDR1_JOVERRUN_Pos            (21)
#define ADC_JDR1_JOVERRUN_Msk            (0x01U << ADC_JDR1_JOVERRUN_Pos) /*!< Overrun flag */
#define ADC_JDR1_JDATA_Pos               (0)
#define ADC_JDR1_JDATA_Msk               (0xFFFFU << ADC_JDR1_JDATA_Pos)  /*!< Transfer data */

/**
  * @brief ADC_JDR2 mode enable Register Bit Definition
  */
#define ADC_JDR2_JVALID_Pos              (22)
#define ADC_JDR2_JVALID_Msk              (0x01U << ADC_JDR2_JVALID_Pos)   /*!< Valid flag */
#define ADC_JDR2_JOVERRUN_Pos            (21)
#define ADC_JDR2_JOVERRUN_Msk            (0x01U << ADC_JDR2_JOVERRUN_Pos) /*!< Overrun flag */
#define ADC_JDR2_JDATA_Pos               (0)
#define ADC_JDR2_JDATA_Msk               (0xFFFFU << ADC_JDR2_JDATA_Pos)  /*!< Transfer data */

/**
  * @brief ADC_JDR3 mode enable Register Bit Definition
  */
#define ADC_JDR3_JVALID_Pos              (22)
#define ADC_JDR3_JVALID_Msk              (0x01U << ADC_JDR3_JVALID_Pos)   /*!< Valid flag */
#define ADC_JDR3_JOVERRUN_Pos            (21)
#define ADC_JDR3_JOVERRUN_Msk            (0x01U << ADC_JDR3_JOVERRUN_Pos) /*!< Overrun flag */
#define ADC_JDR3_JDATA_Pos               (0)
#define ADC_JDR3_JDATA_Msk               (0xFFFFU << ADC_JDR3_JDATA_Pos)  /*!< Transfer data */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/** --------------------------------------------------------------------------*/
#endif
/** --------------------------------------------------------------------------*/

